import math, time

# Εκτύπωση όλων των πρώτων αριθμών έως το 10000 με δοκιμαστικές
# διαιρέσεις έως την τετραγωνική ρίζα, και μέτρηση του χρόνου.


# Εξετάζουμε μόνο τους περιττούς n = 3, 5, 7, ..., 9999.
for n in range(3, 100000001, 2):
    a = True                 # υποθέτουμε ότι ο n είναι πρώτος                     
    for k in range(3, math.ceil(math.sqrt(n)) + 1, 2):
        if n % k == 0:
            a = False                # βρέθηκε γνήσιος διαιρέτης
    if a :
        print(n, end=' ')










