import math
l=[]
for z in range(2,1_000_000):
    isprime = True
    # Το 2 είναι πρώτος, άρα δεν χρειάζεται κανένας έλεγχος.
    if z != 2:
        if z % 2 != 0:
            # Ο z είναι περιττός, άρα δεν έχει άρτιους διαιρέτες.
            # Δοκιμάζουμε μόνο τους περιττούς i = 3, 5, 7, ..., < z.
            for i in range(3, math.ceil(math.sqrt(z)), 2):
                if z % i == 0:
                    # Βρέθηκε γνήσιος διαιρέτης: ο z δεν είναι πρώτος.
                    isprime = False
        else:
            # Ο z είναι άρτιος και διάφορος του 2,
            # άρα διαιρείται από το 2 και δεν είναι πρώτος.
            isprime = False
    # Εκτύπωση του αποτελέσματος (True ή False).
    if isprime:
        l=l+[z]

print(l) 



