# Πολυώνυμο f(x)=x^2+bx+c ὁρισμένο στὸ διάστημα [L,R]
# Εὔρεση ἐλάχιστης τιμῆς τῆς συνάρτησης f(x)
b = float(input('Παρακαλῶ, δῶστε τὸ b: '))
c = float(input('Παρακαλῶ, δῶστε τὸ c: '))
L = float(input('Παρακαλῶ, δῶστε τὸ L: '))
R = float(input('Παρακαλῶ, δῶστε τὸ R: '))
xc = -b / 2
if L > R:
    print('Ἡ τιμὴ τοῦ L πρέπει νὰ μὴν ὑπερβαίνει τὴν τιμὴ τοῦ R')
elif L <= xc and xc <= R:
    fc = c - (b/2)**2
    print(f'Ἡ μικρότερη τιμὴ τῆς συνάρτησης f στὸ διάστημα [L,R] εἶναι ἡ: {fc:6.3f}')
elif xc > R:
    fr = R**2 + b*R + c
    print(f'Ἡ μικρότερη τιμὴ τῆς συνάρτησης f στὸ διάστημα [L,R] εἶναι ἡ: {fr:6.3f}')
else:
    fl = L**2 + b*L + c
    print(f'Ἡ μικρότερη τιμὴ τῆς συνάρτησης f στὸ διάστημα [L,R] εἶναι ἡ: {fl:6.3f}')
