# Αὔξηση ἐμβαδοῦ ἐπιφάνειας
# Διάβασε καὶ ἐμφάνισε τὰ δεδομένα εἰσόδου...
import math

r = float(input('Παρακαλῶ, δῶστε τὴν ἀκτίνα (χιλιόμετρα):'))
delta_r = float(input('Παρακαλῶ, δῶστε τὴν αὔξηση σὲ (χιλιοστά):'))

print(f'Ἀκτίνα σφαίρας = {r:12.7f} χιλιόμετρα')
print(f'Αὔξηση Ἀκτίνας = {delta_r:12.7f} χιλιοστά\n')
print('Αὔξηση ἐμβαδοῦ ἐπιφάνειας:')

dr = delta_r / 10**6

# Μέθοδος 1
delta_A1 = (4*math.pi*(r + dr)**2 - 4*math.pi*r**2) * 10**6
print(f'\n\tΜέθοδος 1: {delta_A1:15.7f} τετρ/κά μέτρα')

# Μέθοδος 2
delta_A2 = (4*math.pi*(2*r + dr)*dr) * 10**6
print(f'\tΜέθοδος 2: {delta_A2:15.7f} τετρ/κά μέτρα')

# Μέθοδος 3
delta_A3 = (8*math.pi*r*dr) * 10**6
print(f'\tΜέθοδος 3: {delta_A3:15.7f} τετρ/κά μέτρα')
