# Πολυώνυμο f(x)=x^2+bx+c ὁρισμένο στὸ διάστημα [L,R]
# Εὔρεση ἐλάχιστης τιμῆς τῆς συνάρτησης f(x)
b = float(input('Παρακαλῶ, δῶστε τὸ b: '))
c = float(input('Παρακαλῶ, δῶστε τὸ c: '))
L = float(input('Παρακαλῶ, δῶστε τὸ L: '))
R = float(input('Παρακαλῶ, δῶστε τὸ R: '))
x0 = -b / 2

if L > R:
    print('Ἡ τιμὴ τοῦ L πρέπει νὰ μὴν ὑπερβαίνει τὴν τιμὴ τοῦ R')
elif L <= x0 and x0 <= R:
    t = c - (b/2)**2
else:
    t = (x0 > R)*(R**2 + b*R + c) + (x0 < L)*(L**2 + b*L + c)

print(f'Ἡ μικρότερη τιμὴ τῆς συνάρτησης f στὸ διάστημα [L,R] εἶναι ἡ: {t:6.3f}')
